app/controllers/collections_controller.rb

	def index
		userid = params[:user]
		articleid = params[:article]
		@user = User.find(userid)
		@article = Article.find(articleid)
		@return = "already added"
		#doing some many to many relationships
		articles = @user.articles
		articles.each do |article|
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
SELECT * FROM "articles" INNER JOIN "articles_users" ON "articles".id = "articles_users".article_id WHERE ("articles_users".user_id = 1 )

	def getclothes
		userid = params[:user]
		render :xml => User.find(userid).articles
---
SELECT * FROM "articles" INNER JOIN "articles_users" ON "articles".id = "articles_users".article_id WHERE ("articles_users".user_id = 1 )
SELECT * FROM "users" WHERE ("users"."id" = 1)

	def getrecommendation
		userid = params[:user]
		user = User.find(userid)
		userArticles = user.articles

		articles = Article.all
		articles.each do |article|
			userArticles.each do |userArticle|
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "articles"
SELECT * FROM "articles" INNER JOIN "articles_users" ON "articles".id = "articles_users".article_id WHERE ("articles_users".user_id = 1 )