app/controllers/home_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES('ming', '2009-10-09 04:18:16', '2009-10-09 04:18:16')
---
  def index
	user = User.new
	user.name = "ming"
	user.save